### Import modules

In [ ]:
import pandas as pd
%matplotlib inline

### read data

In [6]:
db = pd.read_csv('algexit2009.csv')

In [82]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass,perc_all_pass
112,SHOOP,0,6,6,1.000000,0.000000,1.000000,0.000000,6,1.000000
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286,28,1.000000
48,GALILEO SCHOLASTIC,9,4,13,0.307692,0.692308,0.307692,0.692308,13,1.000000
56,HAINES,4,17,22,0.772727,0.181818,0.772727,0.181818,21,0.954545
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000,115,0.920000

In [84]:
db.values

array([['SHOOP', 0, 6, ..., 0.0, 6, 1.0],
       ['THORP O A', 13, 15, ..., 0.4642857142857143, 28, 1.0],
       ['GALILEO SCHOLASTIC', 9, 4, ..., 0.6923076923076923, 13, 1.0],
       ...,
       ['KERSHAW', 0, 0, ..., 0.0, 0, 0.0],
       ['TALCOTT', 0, 0, ..., 0.0, 0, 0.0],
       ['TAYLOR', 0, 0, ..., 0.0, 0, 0.0]], dtype=object)

In [10]:
db.head()

    school_name  total_highpass  total_pass  total
0  ALBANY PARK                1          15     34
1        ALCOTT               1           9     27
2       ALTGELD               0           6     11
3          AMES               0           3     61
4     ANDERSEN                0           6     15

In [11]:
db.tail()

           school_name  total_highpass  total_pass  total
130      WILLIAMS PREP               0           0      7
131  WILLIAMS PREP MED               0           2     26
132              YATES               4          14     20
133          YOUNG, W               34          81    125
134            ZAPATA                0           9     19

In [20]:
# sorting data by total_pass
db.sort(columns = ['total_pass'], inplace = True, ascending = False)

In [26]:
# getting the school with highest total_pass
db[db.total_pass == db.total_pass.max()]

    school_name  total_highpass  total_pass  total
133   YOUNG, W               34          81    125

In [27]:
# getting the school with highest total_highpass
db[db.total_highpass == db.total_highpass.max()]

    school_name  total_highpass  total_pass  total
133   YOUNG, W               34          81    125

In [30]:
# sorting data by total_highpass
db.sort(columns = ['total_highpass'], inplace = True, ascending = False)

In [85]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass,perc_all_pass
112,SHOOP,0,6,6,1.000000,0.000000,1.000000,0.000000,6,1.000000
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286,28,1.000000
48,GALILEO SCHOLASTIC,9,4,13,0.307692,0.692308,0.307692,0.692308,13,1.000000
56,HAINES,4,17,22,0.772727,0.181818,0.772727,0.181818,21,0.954545
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000,115,0.920000

In [38]:
# create new columns for percentage total_pass
db['perc_total_pass'] = db['total_pass']/db['total']

In [35]:
# create new columns for percentage total_highpass
db['perc_total_highpass'] = db['total_highpass']/db['total']

In [86]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass,perc_all_pass
112,SHOOP,0,6,6,1.000000,0.000000,1.000000,0.000000,6,1.000000
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286,28,1.000000
48,GALILEO SCHOLASTIC,9,4,13,0.307692,0.692308,0.307692,0.692308,13,1.000000
56,HAINES,4,17,22,0.772727,0.181818,0.772727,0.181818,21,0.954545
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000,115,0.920000

In [43]:
db.iloc[0, :5]

school_name        YOUNG, W
total_highpass            34
total_pass                81
total                    125
perc_total_pass        0.648
Name: 133, dtype: object

In [46]:
db.iat[0, 0]

'YOUNG, W '

In [49]:
# find percentage for top school (at row index 0)
db.iat[0, 2]/float(db.iat[0, 3])

0.64800000000000002

In [51]:
# create list for values
passpercent = []
for i in range(len(db)):
    passpercent.append(db.iat[i, 2]/float(db.iat[i, 3]))

In [88]:
passpercent

[0.64800000000000002,
 0.31147540983606559,
 0.63414634146341464,
 0.5357142857142857,
 0.55405405405405406,
 0.44827586206896552,
 0.30769230769230771,
 0.41860465116279072,
 0.5,
 0.57692307692307687,
 0.69444444444444442,
 0.41935483870967744,
 0.54838709677419351,
 0.63636363636363635,
 0.25806451612903225,
 0.29032258064516131,
 0.38461538461538464,
 0.69999999999999996,
 0.19230769230769232,
 0.75,
 0.77272727272727271,
 0.4838709677419355,
 0.26785714285714285,
 0.53333333333333333,
 0.56666666666666665,
 0.5,
 0.40000000000000002,
 0.47826086956521741,
 0.58333333333333337,
 0.25,
 0.27272727272727271,
 0.29166666666666669,
 0.3888888888888889,
 0.63414634146341464,
 0.5,
 0.22222222222222221,
 0.69999999999999996,
 0.26666666666666666,
 0.33333333333333331,
 0.24242424242424243,
 0.18518518518518517,
 0.40000000000000002,
 0.10000000000000001,
 0.076923076923076927,
 0.33333333333333331,
 0.54545454545454541,
 0.30434782608695654,
 0.44117647058823528,
 0.47999999999999998,
 0.26666666666666666,
 0.20000000000000001,
 0.8125,
 0.35135135135135137,
 0.33333333333333331,
 0.0,
 0.0,
 0.038461538461538464,
 0.0,
 0.14285714285714285,
 0.045454545454545456,
 0.1111111111111111,
 0.066666666666666666,
 0.071428571428571425,
 0.125,
 0.0,
 0.25,
 0.095238095238095233,
 0.066666666666666666,
 0.0,
 0.2857142857142857,
 0.0625,
 0.14285714285714285,
 0.016949152542372881,
 0.0,
 0.0,
 0.0,
 0.16666666666666666,
 0.0,
 0.20000000000000001,
 0.0,
 0.058823529411764705,
 0.14285714285714285,
 0.0,
 0.10000000000000001,
 0.10000000000000001,
 0.0,
 0.0,
 0.16666666666666666,
 0.10000000000000001,
 0.0,
 0.14285714285714285,
 0.22222222222222221,
 0.14285714285714285,
 0.076923076923076927,
 0.47368421052631576,
 0.40000000000000002,
 0.29999999999999999,
 1.0,
 0.26923076923076922,
 0.3888888888888889,
 0.25925925925925924,
 0.5714285714285714,
 0.81818181818181823,
 0.81818181818181823,
 0.125,
 0.7142857142857143,
 0.36666666666666664,
 0.44,
 0.7857142857142857,
 0.27659574468085107,
 0.625,
 0.42424242424242425,
 0.25,
 0.54545454545454541,
 0.2857142857142857,
 0.66666666666666663,
 0.5,
 0.095238095238095233,
 0.125,
 0.27272727272727271,
 0.16666666666666666,
 0.375,
 0.27272727272727271,
 0.049180327868852458,
 0.16,
 0.13333333333333333,
 0.40000000000000002,
 0.36363636363636365,
 0.19230769230769232,
 0.38461538461538464,
 0.21739130434782608,
 0.35714285714285715,
 0.35714285714285715,
 0.35714285714285715,
 0.0]

In [53]:
db['pass percent'] = passpercent

In [89]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass,perc_all_pass
112,SHOOP,0,6,6,1.000000,0.000000,1.000000,0.000000,6,1.000000
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286,28,1.000000
48,GALILEO SCHOLASTIC,9,4,13,0.307692,0.692308,0.307692,0.692308,13,1.000000
56,HAINES,4,17,22,0.772727,0.181818,0.772727,0.181818,21,0.954545
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000,115,0.920000

In [55]:
highpasspercent = []
for i in range(len(db)):
    highpasspercent.append(db.iat[i, 1]/float(db.iat[i, 3]))

In [56]:
db['high pass percent'] = highpasspercent

In [57]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000
60,HAWTHORNE,21,19,61,0.311475,0.344262,0.311475,0.344262
70,KENWOOD,18,52,82,0.634146,0.219512,0.634146,0.219512
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286
120,TAFT H S,11,41,74,0.554054,0.148649,0.554054,0.148649

In [58]:
db.sort(columns = ['perc_total_pass'], inplace = True, ascending = False)

In [61]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent
112,SHOOP,0,6,6,1.000000,0.0000,1.000000,0.0000
117,STOCKTON,0,9,11,0.818182,0.0000,0.818182,0.0000
13,BLACK,0,9,11,0.818182,0.0000,0.818182,0.0000
54,GUNSAULUS,1,13,16,0.812500,0.0625,0.812500,0.0625
9,BEAUBIEN,0,11,14,0.785714,0.0000,0.785714,0.0000

In [62]:
db.sort(columns = 'perc_total_highpass', inplace = True, ascending = False)

In [63]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent
48,GALILEO SCHOLASTIC,9,4,13,0.307692,0.692308,0.307692,0.692308
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286
53,GRAY,11,13,29,0.448276,0.379310,0.448276,0.379310
60,HAWTHORNE,21,19,61,0.311475,0.344262,0.311475,0.344262
28,CASTELLANOS,2,3,6,0.500000,0.333333,0.500000,0.333333

In [73]:
db['all_pass'] = db.total_pass + db.total_highpass

In [74]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass
48,GALILEO SCHOLASTIC,9,4,13,0.307692,0.692308,0.307692,0.692308,13
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286,28
53,GRAY,11,13,29,0.448276,0.379310,0.448276,0.379310,24
60,HAWTHORNE,21,19,61,0.311475,0.344262,0.311475,0.344262,40
28,CASTELLANOS,2,3,6,0.500000,0.333333,0.500000,0.333333,5

In [75]:
db.sort(columns = 'all_pass', inplace = True, ascending = False)

In [77]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000,115
70,KENWOOD,18,52,82,0.634146,0.219512,0.634146,0.219512,70
120,TAFT H S,11,41,74,0.554054,0.148649,0.554054,0.148649,52
60,HAWTHORNE,21,19,61,0.311475,0.344262,0.311475,0.344262,40
12,BELL,8,30,60,0.500000,0.133333,0.500000,0.133333,38

In [78]:
db['perc_all_pass'] = db.all_pass/db.total

In [79]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass,perc_all_pass
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000,115,0.920000
70,KENWOOD,18,52,82,0.634146,0.219512,0.634146,0.219512,70,0.853659
120,TAFT H S,11,41,74,0.554054,0.148649,0.554054,0.148649,52,0.702703
60,HAWTHORNE,21,19,61,0.311475,0.344262,0.311475,0.344262,40,0.655738
12,BELL,8,30,60,0.500000,0.133333,0.500000,0.133333,38,0.633333

In [80]:
db.sort(columns = 'perc_all_pass', inplace = True, ascending = False)

In [81]:
db.head()

,school_name,total_highpass,total_pass,total,perc_total_pass,perc_total_highpass,pass percent,high pass percent,all_pass,perc_all_pass
112,SHOOP,0,6,6,1.000000,0.000000,1.000000,0.000000,6,1.000000
124,THORP O A,13,15,28,0.535714,0.464286,0.535714,0.464286,28,1.000000
48,GALILEO SCHOLASTIC,9,4,13,0.307692,0.692308,0.307692,0.692308,13,1.000000
56,HAINES,4,17,22,0.772727,0.181818,0.772727,0.181818,21,0.954545
133,"YOUNG, W",34,81,125,0.648000,0.272000,0.648000,0.272000,115,0.920000